Revit 2027 API
ColorFillSchemeEntry.CanSetValue(Int32) Method
 Checks whether StorageType of entry is Integer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSetValue(
	int value
)
Public Function CanSetValue (
	value As Integer
) As Boolean
public:
bool CanSetValue(
	int value
)
member CanSetValue :
        value : int -> bool
Parameters
value Int32
 New Integer value.
Return Value
Boolean
 True if StorageType of the entry is Integer, false otherwise.
See Also
Reference
ColorFillSchemeEntry Class
CanSetValue Overload
Autodesk.Revit.DB Namespace